www/projekat/_protected/models/BuildingQuery.php

    public function all($db = null)
    {
        return parent::all($db);
---
SELECT * FROM `building` ORDER BY `id`