www/projekat/_protected/models/LocationQuery.php

SELECT * FROM `location`
---
    public function all($db = null)
    {
        return parent::all($db);