www/projekat/_protected/models/PersonQuery.php

SELECT * FROM `person` ORDER BY `id`
---
    public function all($db = null)
    {
        return parent::all($db);