www/projekat/_protected/models/StatusQuery.php

    public function all($db = null)
    {
        return parent::all($db);
---
SELECT * FROM `status`