www/projekat/_protected/models/TypeQuery.php

    public function all($db = null)
    {
        return parent::all($db);
---
SELECT * FROM `type`